nguyenlehoangkhai/LVTN-design_and_control_tennis_ball_retreiver_robot/esp32cam-robot-06/app_httpd.cpp
  int val = atoi(value);
  sensor_t * s = esp_camera_sensor_get();
  int res = 0;

// Look at values within URL to determine function
  if (!strcmp(variable, "framesize"))
  {
    Serial.println("framesize");
    if (s->pixformat == PIXFORMAT_JPEG) res = s->set_framesize(s, (framesize_t)val);
  }
  else if (!strcmp(variable, "quality"))
  {
    Serial.println("quality");
    res = s->set_quality(s, val);
  }
  else if (!strcmp(variable, "flash"))
  {
    ledcWrite(7, val);
  }
  else if (!strcmp(variable, "flashoff"))
  {
    ledcWrite(7, val);
  }

  else if (!strcmp(variable, "auto_on"))
  {
    arduino_wake_up();
  }
  else if (!strcmp(variable, "auto_off"))
  {
    arduino_sleep();
  }
  
  else if (!strcmp(variable, "speed"))
  {
    if      (val > 255) val = 255;
    else if (val <   0) val = 0;
    speed = val;
    ledcWrite(8, speed);
  }
  else if (!strcmp(variable, "nostop"))
  {
    noStop = val;
  }
  else if (!strcmp(variable, "car")) {
    if (val == 1) {
      Serial.println("Forward");
      robot_fwd();
      robo = 1;
    }
    else if (val == 2) {
      Serial.println("TurnLeft");
      robot_left();
      robo = 1;
    }
    else if (val == 3) {
      Serial.println("Stop");
      robot_stop();
    }
    else if (val == 4) {
      Serial.println("TurnRight");
      robot_right();
      robo = 1;
    }
    else if (val == 5) {
      Serial.println("Backward");
      robot_back();
      robo = 1;
    }
    if (noStop != 1)
    {

    }
  }
  else
  {
    Serial.println("variable");
    res = -1;
  }

  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t status_handler(httpd_req_t *req) {
  static char json_response[1024];

  sensor_t * s = esp_camera_sensor_get();
  char * p = json_response;
  *p++ = '{';

  p += sprintf(p, "\"framesize\":%u,", s->status.framesize);
  p += sprintf(p, "\"quality\":%u,", s->status.quality);
  *p++ = '}';
  *p++ = 0;
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json_response, strlen(json_response));
}



static esp_err_t index_handler(httpd_req_t *req){
    httpd_resp_set_type(req, "text/html");
    static const char PROGMEM INDEX_HTML[] = R"rawliteral(

<!doctype html>
<html>
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width,initial-scale=1">
        <title>Tennis Retriever Robot - Nguyen Le Hoang Khai - HCMUT</title>
        <style>
    body{font-family:Arial, Helvetica,sans-serif; background:#181818; color:#efefef; font-size:16px}
    h2{font-size:18px}section.main{display:flex}#menu,section.main{flex-direction:column}
    #menu{display:none;flex-wrap:nowrap;min-width:340px;background:#363636;padding:8px;border-radius:4px;margin-top:-10px;margin-right:10px}
    #content{display:flex;flex-wrap:wrap;align-items:stretch}
    figure{padding:0;margin:0;-webkit-margin-before:0;margin-block-start:0;-webkit-margin-after:0;margin-block-end:0;-webkit-margin-start:0;margin-inline-start:0;-webkit-margin-end:0;margin-inline-end:0}
    figure img{display:block;width:100%;height:auto;border-radius:4px;margin-top:8px}
    @media (min-width:800px) and (orientation:landscape){#content{display:flex;flex-wrap:nowrap;align-items:stretch}
    figure img{display:block;max-width:100%;max-height:calc(100vh - 40px);width:auto;height:auto}
    figure{padding:0;margin:0;-webkit-margin-before:0;margin-block-start:0;-webkit-margin-after:0;margin-block-end:0;-webkit-margin-start:0;margin-inline-start:0;-webkit-margin-end:0;margin-inline-end:0}}
    
    section #buttons{display:flex;flex-wrap:nowrap;justify-content:space-between}
          #nav-toggle{cursor:pointer;display:block}
          #nav-toggle-cb{outline:0;opacity:0;width:0;height:0}
          #nav-toggle-cb:checked+#menu{display:flex}
          .input-group{display:flex;flex-wrap:nowrap;line-height:22px;margin:5px 0}
          .input-group>label{display:inline-block;padding-right:10px;min-width:47%}
          .input-group input,
          .input-group select{flex-grow:1}.range-max,.range-min{display:inline-block;padding:0 5px}
      button{display:block;margin:5px;padding:5px 12px;border:0;line-height:28px;cursor:pointer;color:#fff;background:#035806;border-radius:5px;font-size:16px;outline:0;width:100px}
           .button2{background-color:#008cba;width:110px}
           .button3{background-color:#f44336;width:100px}
           .button4{background-color:#e7e7e7;color:#000;width:120px}
           .button5{background-color:#555;width:100px}
           .button6{visibility:hidden;width:100px}button:hover{background:#ff494d}button:active{background:#f21c21}
      button.disabled{cursor:default;background:#a0a0a0}
          
    input[type=range]{-webkit-appearance:none;width:100%;height:22px;background:#363636;cursor:pointer;margin:0}
    input[type=range]:focus{outline:0}input[type=range]::-webkit-slider-runnable-track{width:100%;height:2px;cursor:pointer;background:#efefef;border-radius:0;border:0 solid #efefef}
    input[type=range]::-webkit-slider-thumb{border:1px solid rgba(0,0,30,0);height:22px;width:22px;border-radius:50px;background:#ff3034;cursor:pointer;-webkit-appearance:none;margin-top:-11.5px}
    input[type=range]:focus::-webkit-slider-runnable-track{background:#efefef}
    input[type=range]::-moz-range-track{width:100%;height:2px;cursor:pointer;background:#efefef;border-radius:0;border:0 solid #efefef}
    input[type=range]::-moz-range-thumb{border:1px solid rgba(0,0,30,0);height:22px;width:22px;border-radius:50px;background:#ff3034;cursor:pointer}
    input[type=range]::-ms-track{width:100%;height:2px;cursor:pointer;background:0 0;border-color:transparent;color:transparent}
    input[type=range]::-ms-fill-lower{background:#efefef;border:0 solid #efefef;border-radius:0}
    input[type=range]::-ms-fill-upper{background:#efefef;border:0 solid #efefef;border-radius:0}
    input[type=range]::-ms-thumb{border:1px solid rgba(0,0,30,0);height:22px;width:22px;border-radius:50px;background:#ff3034;cursor:pointer;height:2px}
    input[type=range]:focus::-ms-fill-lower{background:#efefef}
    input[type=range]:focus::-ms-fill-upper{background:#363636}
    .switch{display:block;position:relative;line-height:22px;font-size:16px;height:22px}
    .switch input{outline:0;opacity:0;width:0;height:0}
    .slider{width:50px;height:22px;border-radius:22px;cursor:pointer;background-color:grey}.slider,.slider:before{display:inline-block;transition:.4s}
    .slider:before{position:relative;content:"";border-radius:50%;height:16px;width:16px;left:4px;top:3px;background-color:#fff}
    
    input:checked+.slider{background-color:#ff3034}
    input:checked+.slider:before{-webkit-transform:translateX(26px);transform:translateX(26px)}
    select{border:1px solid #363636;font-size:14px;height:22px;outline:0;border-radius:5px}
    .image-container{position:absolute;top:50px;left:50%;margin-right:-50%;transform:translate(-50%,-50%);min-width:160px}
    .control-container{position:relative;top:400px;left:50%;margin-right:-50%;transform:translate(-50%,-50%)}
    .slider-container{position:absolute;top:750px;margin-left:45%;transform:translate(-50%,-50%)}
    .close{position:absolute;right:5px;top:5px;background:#ff3034;width:16px;height:16px;border-radius:100px;color:#fff;text-align:center;line-height:18px;cursor:pointer}
    .hidden{display:none}
    .rotate90{-webkit-transform:rotate(270deg);-moz-transform:rotate(270deg);-o-transform:rotate(270deg);-ms-transform:rotate(270deg);transform:rotate(270deg)}
           
          
    * {margin: 0; border: 0; padding: 0;}
    #logo1 {
      
        margin: 20px; 
        float: left;
        height: 70px;
        width: 70px; 
        border-radius: 10px;
        position:absolute;
        top:15px;
        left:15px;
        object-fit: cover;

